cripto/cesar.org
#+TITLE: Cifrados clásicos

Los primeros cifrados eran muy básicos ya que solo eran /corrimientos/
del mismo alfabeto en una biyección a otro caracter. Dependiendo del
tamaño del alfabeto se pueden hacer análisis básicos para romperlo.

* Sistemas monoalfabéticos
Estos cifrados desde un punto de vista matemático su función de
cifrado es de un alfabeto al mismo alfabeto, y debe cumplir con
biyección para poder decifrarse correctamente. Los más conocidos son


** Cifrado César
El más básico, se hace un corrimiento del mismo alfabeto. Su función
de cifrado está dado por

$$ f(x) = M_i + b \mod |A| $$

Donde
1. $M$ es el caracter actual, e $i$ es el índice en el alfabeto
2. $b$ es el corrimiento.
3. $\mod |A|$ módulo tamaño del /alfabeto/ $A$. El alfabeto
   corresponde al grupo de letras ordenadas sin
   repetir.


Para un cifrado dado por $f(x) = M_i + 7 \mod 27$, tendríamos un corrimiento
de $7$ caracteres hacia adelante sobre el alfabeto de Español.

| $i$ | caracter | $f(x)$        | $M_i + 7 \mod 27$ |
|-----+----------+---------------+-------------------|
|   0 | A        | 7             | H                 |
|   1 | B        | 8             | I                 |
|   2 | C        | 9             | J                 |
| ... | ...      | ...           | ...               |
|  18 | R        | 25            | Y                 |
|  19 | S        | 26            | Z                 |
|  20 | T        | 27 $\equiv$ 0 | A                 |
|  21 | U        | 28 $\equiv$ 1 | B                 |
| ... | ...      | ...           | ...               |
|  26 | Z        | 32 $\equiv$ 6 | G                 |



Cuando llegamos al final $S= Z$, el módulo nos ayuda a /repetir el
alfabeto/ desde el inicio. Claramente si se utilizan más caractéres,
el alfabeto /forzosamente/ debe incluir estos caracteres.

Rápidamente podemos crear un cifrado del siguiente texto con una
función $f(x) = M_i + 22 \mod 27$ y un alfabeto
~abcdefghijklmnopqrstuvwxyz .~ (el espacio y punto también cuentan como parte
del alfabeto)

#+begin_verse
change your thoughts and you change your world.
#+end_verse
$\Rightarrow$
#+begin_verse
ybwha usiolunbioabnmuwhzusiouybwha usioluqilfzv
#+end_verse

*Notemos* que para regresar al carácter original /desde el texto
cifrado/, debemos hacer un /anticorrimiento/ con $b = -22 \equiv -22
\mod 28 \equiv 6$; es decir para /restar 22/ posiciones, debemos
sumar $6$ posiciones y son equivalentes por el módulo. Normalmente no
trabajamos con números negativos en /módulos/, y tienen el nombre de
*inverso aditivo*, así 6 es el /inverso aditivo de/ 22 módulo 28.

También utilizando álgebra podemos sacar el inverso como:
\begin{align*}
22 + b &\equiv 0 \mod 28\\
22 + 6 &\equiv 0 \mod 28 \\
28 &\equiv 0 \mod 28 \\
0 &\equiv 0 \mod 28
\end{align*}

Usamos 0 porque es la /identidad/ del alfabeto en ese corrimiento.

Así, la clave para descifrar el texto cifrado es *6*; el nuevo
corrimiento que debemos usar para /descifrar/ al texto. /El módulo
sigue siendo el mismo/ ya que solo ayuda a /repetir caracteres/.

*** Combinatoria
Notamos que el número de posibles cifrados que pueden hacerse con
/cifrado César/ son:

$$ 0 \leq b < |A| $$

Donde $b = 0$ es la combinación /trivial/ ya que no modifica el texto
a cifrar.

Por lo que si el tamaño del alfabeto es relativamente pequeño,
descifrarlo por fuerza bruta es relativamente fácil. Aunque también
existe el análisis del idioma que veremos más adelante.

*** Ejercicio
Descifra el siguiente texto utilizando el siguiente alfabeto. Elimina
los saltos de línea.

#+begin_src java
  String alfabeto = "abcdefghijklmnñopqrstuvwxyz., ";
#+end_src


#+begin_verse
waru.waerceujkhceruecj.wcwrbsirwijhwaasirvwrasirgkwrfkwveruecjshqrsk
cgkwrbwceirvwru.cuerb.ariecrl.i.tawirsri.bfawrl.ijsprwarkc.lwhiereti
whlstawruecj.wcwrsahwvwvehrvwriwjwcjsrt.aaecwirvwrwijhwaasiprfwherwa
rckbwhervwrwijhwaasirwirx.c.jeqrb.wcjhsirgkwraeirckbwheircsjkhsawiri
ecr.cx.c.jeiprukwcjsrjevsirasirwijhwaasirñrskcrjwrgkwvshscrjscjeirck
bwheircsjkhsawiruebersarfh.cu.f.ep
#+end_verse


