cripto/cesar.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-08-07 Thu 22:58 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Cifrados clásicos</title>
<meta name="author" content="Davidshiro Pichu" />
<meta name="generator" content="Org Mode" />

</head>
<body>
<div id="content" class="content">
<h1 class="title">Cifrados clásicos</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org7ce47a1">1. Sistemas monoalfabéticos</a>
<ul>
<li><a href="#org98c4301">1.1. Cifrado César</a>
<ul>
<li><a href="#orga198ecc">1.1.1. Combinatoria</a></li>
<li><a href="#org6c21d8a">1.1.2. Ejercicio</a></li>
</ul>
</li>
<li><a href="#orgdf83a9b">1.2. Cifrado Decimado</a>
<ul>
<li><a href="#org193fa01">1.2.1. Combinatoria</a></li>
<li><a href="#org8a84ec8">1.2.2. Ejercicio:</a></li>
</ul>
</li>
<li><a href="#orgd539d70">1.3. Cifrado Afín</a>
<ul>
<li><a href="#orgfcf7735">1.3.1. Combinatoria</a></li>
<li><a href="#org6b4cd8a">1.3.2. Ejercicio</a></li>
</ul>
</li>
<li><a href="#org3f4ed80">1.4. Cifrado con palabras</a></li>
<li><a href="#org5da7359">1.5. Análisis</a></li>
</ul>
</li>
<li><a href="#org93a5430">2. Sistemas polialfabéticos</a>
<ul>
<li><a href="#orgf826d56">2.1. Cifrado Vigenere</a></li>
</ul>
</li>
<li><a href="#org667f4cd">3. Sistemas poligráficos</a>
<ul>
<li><a href="#orga33a283">3.1. Cifrado Playfair</a></li>
<li><a href="#orgd4a0e68">3.2. Cifrado Hill</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
Los primeros cifrados eran muy básicos ya que solo eran <i>corrimientos</i>
del mismo alfabeto en una biyección a otro caracter. Dependiendo del
tamaño del alfabeto se pueden hacer análisis básicos para romperlo.
</p>
<div id="outline-container-org7ce47a1" class="outline-2">
<h2 id="org7ce47a1"><span class="section-number-2">1.</span> Sistemas monoalfabéticos</h2>
<div class="outline-text-2" id="text-1">
<p>
Estos cifrados desde un punto de vista matemático su función de
cifrado es de un alfabeto al mismo alfabeto, y debe cumplir con
biyección para poder decifrarse correctamente. Los más conocidos son
</p>
</div>
<div id="outline-container-org98c4301" class="outline-3">
<h3 id="org98c4301"><span class="section-number-3">1.1.</span> Cifrado César</h3>
<div class="outline-text-3" id="text-1-1">
<p>
El más básico, se hace un corrimiento del mismo alfabeto. Su función
de cifrado está dado por
</p>

<p>
\[ f(x) = M_i + b \mod |A| \]
</p>

<p>
Donde
</p>
<ol class="org-ol">
<li>\(M\) es el caracter actual, e \(i\) es el índice en el alfabeto</li>
<li>\(b\) es el corrimiento.</li>
<li>\(\mod |A|\) módulo tamaño del <i>alfabeto</i> \(A\). El alfabeto
corresponde al grupo de letras ordenadas sin
repetir.</li>
</ol>


<p>
Para un cifrado dado por \(f(x) = M_i + 7 \mod 27\), tendríamos un corrimiento
de \(7\) caracteres hacia adelante sobre el alfabeto de Español.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">\(i\)</th>
<th scope="col" class="org-left">caracter</th>
<th scope="col" class="org-left">\(f(x)\)</th>
<th scope="col" class="org-left">\(M_i + 7 \mod 27\)</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">0</td>
<td class="org-left">A</td>
<td class="org-left">7</td>
<td class="org-left">H</td>
</tr>

<tr>
<td class="org-right">1</td>
<td class="org-left">B</td>
<td class="org-left">8</td>
<td class="org-left">I</td>
</tr>

<tr>
<td class="org-right">2</td>
<td class="org-left">C</td>
<td class="org-left">9</td>
<td class="org-left">J</td>
</tr>

<tr>
<td class="org-right">&#x2026;</td>
<td class="org-left">&#x2026;</td>
<td class="org-left">&#x2026;</td>
<td class="org-left">&#x2026;</td>
</tr>

<tr>
<td class="org-right">18</td>
<td class="org-left">R</td>
<td class="org-left">25</td>
<td class="org-left">Y</td>
</tr>

<tr>
<td class="org-right">19</td>
<td class="org-left">S</td>
<td class="org-left">26</td>
<td class="org-left">Z</td>
</tr>

<tr>
<td class="org-right">20</td>
<td class="org-left">T</td>
<td class="org-left">27 \(\equiv\) 0</td>
<td class="org-left">A</td>
</tr>

<tr>
<td class="org-right">21</td>
<td class="org-left">U</td>
<td class="org-left">28 \(\equiv\) 1</td>
<td class="org-left">B</td>
</tr>

<tr>
<td class="org-right">&#x2026;</td>
<td class="org-left">&#x2026;</td>
<td class="org-left">&#x2026;</td>
<td class="org-left">&#x2026;</td>
</tr>

<tr>
<td class="org-right">26</td>
<td class="org-left">Z</td>
<td class="org-left">32 \(\equiv\) 6</td>
<td class="org-left">G</td>
</tr>
</tbody>
</table>



<p>
Cuando llegamos al final \(S= Z\), el módulo nos ayuda a <i>repetir el
alfabeto</i> desde el inicio. Claramente si se utilizan más caractéres,
el alfabeto <i>forzosamente</i> debe incluir estos caracteres.
</p>

<p>
Rápidamente podemos crear un cifrado del siguiente texto con una
función \(f(x) = M_i + 22 \mod 27\) y un alfabeto
<code>abcdefghijklmnopqrstuvwxyz .</code> (el espacio y punto también cuentan como parte
del alfabeto)
</p>

<p class="verse">
change your thoughts and you change your world.<br />
</p>
<p>
\(\Rightarrow\)
</p>
<p class="verse">
ybwha usiolunbioabnmuwhzusiouybwha usioluqilfzv<br />
</p>

<p>
<b>Notemos</b> que para regresar al carácter original <i>desde el texto
cifrado</i>, debemos hacer un <i>anticorrimiento</i> con \(b = -22 \equiv -22
\mod 28 \equiv 6\); es decir para <i>restar 22</i> posiciones, debemos
sumar \(6\) posiciones y son equivalentes por el módulo. Normalmente no
trabajamos con números negativos en <i>módulos</i>, y tienen el nombre de
<b>inverso aditivo</b>, así 6 es el <i>inverso aditivo de</i> 22 módulo 28.
</p>

<p>
También utilizando álgebra podemos sacar el inverso como:
</p>
\begin{align*}
22 + b &\equiv 0 \mod 28\\
22 + 6 &\equiv 0 \mod 28 \\
28 &\equiv 0 \mod 28 \\
0 &\equiv 0 \mod 28
\end{align*}

<p>
Usamos 0 porque es la <i>identidad</i> del alfabeto en ese corrimiento.
</p>

<p>
Así, la clave para descifrar el texto cifrado es <b>6</b>; el nuevo
corrimiento que debemos usar para <i>descifrar</i> al texto. <i>El módulo
sigue siendo el mismo</i> ya que solo ayuda a <i>repetir caracteres</i>.
</p>
</div>
<div id="outline-container-orga198ecc" class="outline-4">
<h4 id="orga198ecc"><span class="section-number-4">1.1.1.</span> Combinatoria</h4>
<div class="outline-text-4" id="text-1-1-1">
<p>
Notamos que el número de posibles cifrados que pueden hacerse con
<i>cifrado César</i> son:
</p>

<p>
\[ 0 \leq b < |A| \]
</p>

<p>
Donde \(b = 0\) es la combinación <i>trivial</i> ya que no modifica el texto
a cifrar.
</p>

<p>
Por lo que si el tamaño del alfabeto es relativamente pequeño,
descifrarlo por fuerza bruta es relativamente fácil. Aunque también
existe el análisis del idioma que veremos más adelante.
</p>
</div>
</div>
<div id="outline-container-org6c21d8a" class="outline-4">
<h4 id="org6c21d8a"><span class="section-number-4">1.1.2.</span> Ejercicio</h4>
<div class="outline-text-4" id="text-1-1-2">
<p>
Descifra el siguiente texto utilizando el siguiente alfabeto. Elimina
los saltos de línea.
</p>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #98f5ff;">String</span> <span style="color: #4eee94;">alfabeto</span> = <span style="color: #deb887;">"abcdefghijklmn&#241;opqrstuvwxyz., "</span>;
</pre>
</div>


<p class="verse">
waru.waerceujkhceruecj.wcwrbsirwijhwaasirvwrasirgkwrfkwveruecjshqrsk<br />
cgkwrbwceirvwru.cuerb.ariecrl.i.tawirsri.bfawrl.ijsprwarkc.lwhiereti<br />
whlstawruecj.wcwrsahwvwvehrvwriwjwcjsrt.aaecwirvwrwijhwaasiprfwherwa<br />
rckbwhervwrwijhwaasirwirx.c.jeqrb.wcjhsirgkwraeirckbwheircsjkhsawiri<br />
ecr.cx.c.jeiprukwcjsrjevsirasirwijhwaasirñrskcrjwrgkwvshscrjscjeirck<br />
bwheircsjkhsawiruebersarfh.cu.f.ep<br />
</p>
</div>
</div>
</div>
