cripto/cesar.org
** Cifrado Decimado
Una pequeña modificación que podríamos hacer a /cifrado césar/ es que
en lugar de *sumar* un número (restar es exactamente lo mismo),
*multipliquemos* por alguna constante, es decir que la función sea:

$$ f(x) = M_i* a \mod |A| $$

Aquí $a$ es un corrimiento /escalado/ del caracter, así si el caracter
en cuestión es $c = 2$, y $a = 10$, entonces la letra cifrada es $u =
20$.


Sin embargo, este cifrado /aunque parece más complejo/ ya que no son
simples corrimientos y podría dar la vuelta al alfabeto más rápido, no
es necesariamente /mejor/. La tabla de mapeo para $f(x) = M_i * 10
\mod 26$ (para un alfabeto sin la ñ) sería como



| *caracter* | A | B | C | D | E | F | G | H | I | J | K | L | M | N | O | P | Q | R | S | T | U | V | W | X | Y | Z |
| *f(x)*     | A | K | U | E | O | Y | I | S | C | M | W | G | Q | A | K | U | E | O | Y | I | S | C | M | W | G | Q |

Rápidamente notamos que /se repiten los carácteres/ lo cual significa
que *la función no es biyectiva*; ya que $E, R \Rightarrow O$, así si
tenemos una $O$ cifrada, el destinatario no sabría si descifrarla a la
/E/ o a la /R/ por lo que $10$ no sirve para cifrarlo.


Lo que sucede aquí es que $mcd(10, 26)$ es 2, ya que $\frac{10}{2} =
5$ y $\frac{26}{2} = 13$ por lo que existirán dos caracteres van a dar
al mismo caracter. De hecho un peor número para cifrar sería $13$ ya
que $mcd(13, 26) = 13$, habiendo 13 caracteres a un mismo caracter, es
decir, cifrar todo el alfabeto a solo 2 caracteres.

Así, debemos tener cuidado a la hora de /escoger/ nuestro $a$, en
resumen debe ser que $mcd(a, n) = 1$ con $n = |A|$. Por lo que los
números que cumplen esto son pocos, en particular son ~[1, 3, 5, 7, 9,
11, 15, 17, 19, 21, 23, 25]~; también conocidos como *primos relativos
de* n. Con $a = 11$ la tabla de biyección es

| *caracter* | A | B | C | D | E | F | G | H | I | J | K | L | M | N | O | P | Q | R | S | T | U | V | W | X | Y | Z |
|------------+---+---+---+---+---+---+---+---+---+---+---+---+---+---+---+---+---+---+---+---+---+---+---+---+---+---|
| *f(x)*     | A | L | W | H | S | D | O | Z | K | V | G | R | C | N | Y | J | U | F | Q | B | M | X | I | T | E | P |


\begin{equation*}
\text{youwillneverknowhunger} \Rightarrow \text{eymikrrnsxsfgnyizmnosf}
\end{equation*}


si ciframos el caracter $L = 11$ con $a = 11$ , obtenemos el caracter
$C_2$ en la posición 17 (R).

\begin{align*}
C_1 * a &\equiv C_2 \mod N\\
11 * 11 &\equiv ? \mod 26 \\
121 &\equiv ? \mod 26\\
17 &\equiv 17 \mod 26
\end{align*}

Entonces el proceso /inverso/ es encontrar el inverso de $a$ digamos
$a^{-1}$ tal que multiplicado por el caracter /cifrado/ nos de el
caracter original; en otras palabras 

\begin{align*}
C_1 * a &\equiv C_2 \mod N \hspace{1cm} \textit{original}\\
C_1 * a * a^{-1} &\equiv C_2 * a^{-1} \mod N\\
C_1 * 1 &\equiv C_2 * a^{-1} \mod N
\end{align*}

Observa como /despejamos/ el valor de $C_1$, *multiplicamos de ambos
lados por inverso* ya que $a^{-1}$ y *no es el valor* $\frac{1}{a} =
\frac{1}{11}$ sino que es la relación $a * a^{-1} \equiv 1 \mod N$;
además que no tendría sentido hacer $\frac{17}{11} = 1.545454\dots$ en un
campo entero finito.


Claramente no sabemos el valor de $a^{-1}$ pero al igual que /César/
podemos calcularlo con fuerza bruta, o utilizando el algoritmo de la
división. Sabemos que $a = 11$, y módulo es 26. Como son /primos
relativos/ y el $mcd(11, 26) = 1$ entonces existe una combinación
lineal de $a, N$ tal que.

$$ 11x + 26 y = 1$$

$x$ corresponde al inverso multiplicativo claramente. Hacemos el
algoritmo de la división como

\begin{align}
26 &=  11 * 2 + 4 \hspace{2cm} \rightarrow 4 = 26 - 11*2\\
11 &= 4 * 2 + 3 \hspace{2cm} \rightarrow 3 = 11 - 4*2\\
4 &= 3*1 + 1  \hspace{2cm}\rightarrow 1 = 4 - 3*1\\
3 &= 1 * 3 + 0
\end{align}

Hacemos la reconstrucción de la combinación lineal despejando de las
anteriores ecuaciones el residuo.
\begin{align*}
1 &= 4 - (3*1) \hspace{2cm} \dots (3)\\
&= 4 - ((11-4*2)*1) \hspace{2cm} \dots (2)\\
&= 4 - 11 + 4*2 \\
&= -11 + 4*3 \\
&= -11 + (26 - 11*2)*3  \hspace{2cm} \dots (1)\\
&= -11 + (26*3 - 11*6)\\
&= -11 + 26*3 - 11*6\\
&= 26*3 + 11* (-7)
\end{align*}

Por lo que el /inverso multiplicativo/ de 11 es $-7$, el cual haciendo
módulo (o restando al módulo 7) $-7 \mod 26 = 26 - 7 = 19$. Así el
inverso de $a = 11$ es $a^{-1} = 19$ en $O(log(n))$



Es claro que si /no conocemos la llave con la que fue cifrado el
texto/ encontrar el inverso es más dificil ya que no poseemos
información suficiente y debemos recurrir a la fuerza bruta.


*** Combinatoria
Dada la restricción de que $mcd(a, n) = 1$, el número de posibles
combinaciones sería la cardinalidad del conjunto.

$$ \{ a \in [0, n)\hspace{.5cm} |\hspace{.5cm} mcd(a, n) = 1\} $$

O el número de *primos relativos con n*. Si el tamaño del alfabeto es
/primo/ entonces $mcd(k, p)$ siempre será 1, con $p$ un primo y a lo
más serán /n/ posibles combinaciones.

