cripto/cesar.html
<div id="outline-container-orgdf83a9b" class="outline-3">
<h3 id="orgdf83a9b"><span class="section-number-3">1.2.</span> Cifrado Decimado</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Una pequeña modificación que podríamos hacer a <i>cifrado césar</i> es que
en lugar de <b>sumar</b> un número (restar es exactamente lo mismo),
<b>multipliquemos</b> por alguna constante, es decir que la función sea:
</p>

<p>
\[ f(x) = M_i* a \mod |A| \]
</p>

<p>
Aquí \(a\) es un corrimiento <i>escalado</i> del caracter, así si el caracter
en cuestión es \(c = 2\), y \(a = 10\), entonces la letra cifrada es \(u =
20\).
</p>


<p>
Sin embargo, este cifrado <i>aunque parece más complejo</i> ya que no son
simples corrimientos y podría dar la vuelta al alfabeto más rápido, no
es necesariamente <i>mejor</i>. La tabla de mapeo para \(f(x) = M_i * 10
\mod 26\) (para un alfabeto sin la ñ) sería como
</p>



<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><b>caracter</b></td>
<td class="org-left">A</td>
<td class="org-left">B</td>
<td class="org-left">C</td>
<td class="org-left">D</td>
<td class="org-left">E</td>
<td class="org-left">F</td>
<td class="org-left">G</td>
<td class="org-left">H</td>
<td class="org-left">I</td>
<td class="org-left">J</td>
<td class="org-left">K</td>
<td class="org-left">L</td>
<td class="org-left">M</td>
<td class="org-left">N</td>
<td class="org-left">O</td>
<td class="org-left">P</td>
<td class="org-left">Q</td>
<td class="org-left">R</td>
<td class="org-left">S</td>
<td class="org-left">T</td>
<td class="org-left">U</td>
<td class="org-left">V</td>
<td class="org-left">W</td>
<td class="org-left">X</td>
<td class="org-left">Y</td>
<td class="org-left">Z</td>
</tr>

<tr>
<td class="org-left"><b>f(x)</b></td>
<td class="org-left">A</td>
<td class="org-left">K</td>
<td class="org-left">U</td>
<td class="org-left">E</td>
<td class="org-left">O</td>
<td class="org-left">Y</td>
<td class="org-left">I</td>
<td class="org-left">S</td>
<td class="org-left">C</td>
<td class="org-left">M</td>
<td class="org-left">W</td>
<td class="org-left">G</td>
<td class="org-left">Q</td>
<td class="org-left">A</td>
<td class="org-left">K</td>
<td class="org-left">U</td>
<td class="org-left">E</td>
<td class="org-left">O</td>
<td class="org-left">Y</td>
<td class="org-left">I</td>
<td class="org-left">S</td>
<td class="org-left">C</td>
<td class="org-left">M</td>
<td class="org-left">W</td>
<td class="org-left">G</td>
<td class="org-left">Q</td>
</tr>
</tbody>
</table>

<p>
Rápidamente notamos que <i>se repiten los carácteres</i> lo cual significa
que <b>la función no es biyectiva</b>; ya que \(E, R \Rightarrow O\), así si
tenemos una \(O\) cifrada, el destinatario no sabría si descifrarla a la
<i>E</i> o a la <i>R</i> por lo que \(10\) no sirve para cifrarlo.
</p>


<p>
Lo que sucede aquí es que \(mcd(10, 26)\) es 2, ya que \(\frac{10}{2} =
5\) y \(\frac{26}{2} = 13\) por lo que existirán dos caracteres van a dar
al mismo caracter. De hecho un peor número para cifrar sería \(13\) ya
que \(mcd(13, 26) = 13\), habiendo 13 caracteres a un mismo caracter, es
decir, cifrar todo el alfabeto a solo 2 caracteres.
</p>

<p>
Así, debemos tener cuidado a la hora de <i>escoger</i> nuestro \(a\), en
resumen debe ser que \(mcd(a, n) = 1\) con \(n = |A|\). Por lo que los
números que cumplen esto son pocos, en particular son <code>[1, 3, 5, 7, 9,
11, 15, 17, 19, 21, 23, 25]</code>; también conocidos como <b>primos relativos
de</b> n. Con \(a = 11\) la tabla de biyección es
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left"><b>caracter</b></th>
<th scope="col" class="org-left">A</th>
<th scope="col" class="org-left">B</th>
<th scope="col" class="org-left">C</th>
<th scope="col" class="org-left">D</th>
<th scope="col" class="org-left">E</th>
<th scope="col" class="org-left">F</th>
<th scope="col" class="org-left">G</th>
<th scope="col" class="org-left">H</th>
<th scope="col" class="org-left">I</th>
<th scope="col" class="org-left">J</th>
<th scope="col" class="org-left">K</th>
<th scope="col" class="org-left">L</th>
<th scope="col" class="org-left">M</th>
<th scope="col" class="org-left">N</th>
<th scope="col" class="org-left">O</th>
<th scope="col" class="org-left">P</th>
<th scope="col" class="org-left">Q</th>
<th scope="col" class="org-left">R</th>
<th scope="col" class="org-left">S</th>
<th scope="col" class="org-left">T</th>
<th scope="col" class="org-left">U</th>
<th scope="col" class="org-left">V</th>
<th scope="col" class="org-left">W</th>
<th scope="col" class="org-left">X</th>
<th scope="col" class="org-left">Y</th>
<th scope="col" class="org-left">Z</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><b>f(x)</b></td>
<td class="org-left">A</td>
<td class="org-left">L</td>
<td class="org-left">W</td>
<td class="org-left">H</td>
<td class="org-left">S</td>
<td class="org-left">D</td>
<td class="org-left">O</td>
<td class="org-left">Z</td>
<td class="org-left">K</td>
<td class="org-left">V</td>
<td class="org-left">G</td>
<td class="org-left">R</td>
<td class="org-left">C</td>
<td class="org-left">N</td>
<td class="org-left">Y</td>
<td class="org-left">J</td>
<td class="org-left">U</td>
<td class="org-left">F</td>
<td class="org-left">Q</td>
<td class="org-left">B</td>
<td class="org-left">M</td>
<td class="org-left">X</td>
<td class="org-left">I</td>
<td class="org-left">T</td>
<td class="org-left">E</td>
<td class="org-left">P</td>
</tr>
</tbody>
</table>


\begin{equation*}
\text{youwillneverknowhunger} \Rightarrow \text{eymikrrnsxsfgnyizmnosf}
\end{equation*}


<p>
si ciframos el caracter \(L = 11\) con \(a = 11\) , obtenemos el caracter
\(C_2\) en la posición 17 (R).
</p>

\begin{align*}
C_1 * a &\equiv C_2 \mod N\\
11 * 11 &\equiv ? \mod 26 \\
121 &\equiv ? \mod 26\\
17 &\equiv 17 \mod 26
\end{align*}

<p>
Entonces el proceso <i>inverso</i> es encontrar el inverso de \(a\) digamos
\(a^{-1}\) tal que multiplicado por el caracter <i>cifrado</i> nos de el
caracter original; en otras palabras 
</p>

\begin{align*}
C_1 * a &\equiv C_2 \mod N \hspace{1cm} \textit{original}\\
C_1 * a * a^{-1} &\equiv C_2 * a^{-1} \mod N\\
C_1 * 1 &\equiv C_2 * a^{-1} \mod N
\end{align*}

<p>
Observa como <i>despejamos</i> el valor de \(C_1\), <b>multiplicamos de ambos
lados por inverso</b> ya que \(a^{-1}\) y <b>no es el valor</b> \(\frac{1}{a} =
\frac{1}{11}\) sino que es la relación \(a * a^{-1} \equiv 1 \mod N\);
además que no tendría sentido hacer \(\frac{17}{11} = 1.545454\dots\) en un
campo entero finito.
</p>


<p>
Claramente no sabemos el valor de \(a^{-1}\) pero al igual que <i>César</i>
podemos calcularlo con fuerza bruta, o utilizando el algoritmo de la
división. Sabemos que \(a = 11\), y módulo es 26. Como son <i>primos
relativos</i> y el \(mcd(11, 26) = 1\) entonces existe una combinación
lineal de \(a, N\) tal que.
</p>

<p>
\[ 11x + 26 y = 1\]
</p>

<p>
\(x\) corresponde al inverso multiplicativo claramente. Hacemos el
algoritmo de la división como
</p>

\begin{align}
26 &=  11 * 2 + 4 \hspace{2cm} \rightarrow 4 = 26 - 11*2\\
11 &= 4 * 2 + 3 \hspace{2cm} \rightarrow 3 = 11 - 4*2\\
4 &= 3*1 + 1  \hspace{2cm}\rightarrow 1 = 4 - 3*1\\
3 &= 1 * 3 + 0
\end{align}

<p>
Hacemos la reconstrucción de la combinación lineal despejando de las
anteriores ecuaciones el residuo.
</p>
\begin{align*}
1 &= 4 - (3*1) \hspace{2cm} \dots (3)\\
&= 4 - ((11-4*2)*1) \hspace{2cm} \dots (2)\\
&= 4 - 11 + 4*2 \\
&= -11 + 4*3 \\
&= -11 + (26 - 11*2)*3  \hspace{2cm} \dots (1)\\
&= -11 + (26*3 - 11*6)\\
&= -11 + 26*3 - 11*6\\
&= 26*3 + 11* (-7)
\end{align*}

<p>
Por lo que el <i>inverso multiplicativo</i> de 11 es \(-7\), el cual haciendo
módulo (o restando al módulo 7) \(-7 \mod 26 = 26 - 7 = 19\). Así el
inverso de \(a = 11\) es \(a^{-1} = 19\) en \(O(log(n))\)
</p>



<p>
Es claro que si <i>no conocemos la llave con la que fue cifrado el
texto</i> encontrar el inverso es más dificil ya que no poseemos
información suficiente y debemos recurrir a la fuerza bruta.
</p>
</div>
<div id="outline-container-org193fa01" class="outline-4">
<h4 id="org193fa01"><span class="section-number-4">1.2.1.</span> Combinatoria</h4>
<div class="outline-text-4" id="text-1-2-1">
<p>
Dada la restricción de que \(mcd(a, n) = 1\), el número de posibles
combinaciones sería la cardinalidad del conjunto.
</p>

<p>
\[ \{ a \in [0, n)\hspace{.5cm} |\hspace{.5cm} mcd(a, n) = 1\} \]
</p>

<p>
O el número de <b>primos relativos con n</b>. Si el tamaño del alfabeto es
<i>primo</i> entonces \(mcd(k, p)\) siempre será 1, con \(p\) un primo y a lo
más serán <i>n</i> posibles combinaciones.
</p>
</div>
</div>
