cripto/cesar.org
*** Ejercicio:

Descifra el siguiente texto decimado usando el alfabeto

#+begin_src java
  String alfabeto = "ABCDEFGHIJKLMNÑOPQRSTUVWXYZabcdefghijklmnñopqrstuvwxyz .-"
#+end_src

#+begin_verse
Yxrfx.HfyxnnH IrGcrUIro ocI. rcfrSxrJUHIxrGcSrfHRUHcI.cLrhhtZLrY qcnJxy.
#+end_verse


** Cifrado Afín
Finalmente, podemos tener una combinación de /César/ y /Decimado/ en
una sola ecuación como

$$ f(x) = M_i * a + b \mod N$$

Al igual que el cifrado /Decimado/ nuestro valor de $a$ debe cumplir
con $mcd(a, N) = 1$.

Utilizando los valores $a = 7$, $b = 3$ tendremos una biyección con
nuestro mismo alfabeto /inglés/ gcomo

| caracter | A | B | C | D | E | F | G | H | I | J | K | L | M | N | O | P | Q | R | S | T | U | V | W | X | Y | Z |
|----------+---+---+---+---+---+---+---+---+---+---+---+---+---+---+---+---+---+---+---+---+---+---+---+---+---+---|
| f(x)     | D | K | R | Y | F | M | T | A | H | O | V | C | J | Q | X | E | L | S | Z | G | N | U | B | I | P | W |


*** Combinatoria

*** Ejercicio

#+begin_quote
Pensar es olvidar diferencias, es generalizar, es abstraer. -- Jorge Luis Borgas
#+end_quote
** Cifrado con palabras

** Análisis


* Sistemas polialfabéticos
** Cifrado Vigenere

* Sistemas poligráficos
** Cifrado Playfair
** Cifrado Hill




