cripto/cesar.html
<div id="outline-container-org8a84ec8" class="outline-4">
<h4 id="org8a84ec8"><span class="section-number-4">1.2.2.</span> Ejercicio:</h4>
<div class="outline-text-4" id="text-1-2-2">
<p>
Descifra el siguiente texto decimado usando el alfabeto
</p>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #98f5ff;">String</span> <span style="color: #4eee94;">alfabeto</span> = <span style="color: #deb887;">"ABCDEFGHIJKLMN&#209;OPQRSTUVWXYZabcdefghijklmn&#241;opqrstuvwxyz .-"</span>
</pre>
</div>

<p class="verse">
Yxrfx.HfyxnnH IrGcrUIro ocI. rcfrSxrJUHIxrGcSrfHRUHcI.cLrhhtZLrY qcnJxy.<br />
</p>
</div>
</div>
</div>
<div id="outline-container-orgd539d70" class="outline-3">
<h3 id="orgd539d70"><span class="section-number-3">1.3.</span> Cifrado Afín</h3>
<div class="outline-text-3" id="text-1-3">
<p>
Finalmente, podemos tener una combinación de <i>César</i> y <i>Decimado</i> en
una sola ecuación como
</p>

<p>
\[ f(x) = M_i * a + b \mod N\]
</p>

<p>
Al igual que el cifrado <i>Decimado</i> nuestro valor de \(a\) debe cumplir
con \(mcd(a, N) = 1\).
</p>

<p>
Utilizando los valores \(a = 7\), \(b = 3\) tendremos una biyección con
nuestro mismo alfabeto <i>inglés</i> como
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">caracter</th>
<th scope="col" class="org-left">A</th>
<th scope="col" class="org-left">B</th>
<th scope="col" class="org-left">C</th>
<th scope="col" class="org-left">D</th>
<th scope="col" class="org-left">E</th>
<th scope="col" class="org-left">F</th>
<th scope="col" class="org-left">G</th>
<th scope="col" class="org-left">H</th>
<th scope="col" class="org-left">I</th>
<th scope="col" class="org-left">J</th>
<th scope="col" class="org-left">K</th>
<th scope="col" class="org-left">L</th>
<th scope="col" class="org-left">M</th>
<th scope="col" class="org-left">N</th>
<th scope="col" class="org-left">O</th>
<th scope="col" class="org-left">P</th>
<th scope="col" class="org-left">Q</th>
<th scope="col" class="org-left">R</th>
<th scope="col" class="org-left">S</th>
<th scope="col" class="org-left">T</th>
<th scope="col" class="org-left">U</th>
<th scope="col" class="org-left">V</th>
<th scope="col" class="org-left">W</th>
<th scope="col" class="org-left">X</th>
<th scope="col" class="org-left">Y</th>
<th scope="col" class="org-left">Z</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">f(x)</td>
<td class="org-left">D</td>
<td class="org-left">K</td>
<td class="org-left">R</td>
<td class="org-left">Y</td>
<td class="org-left">F</td>
<td class="org-left">M</td>
<td class="org-left">T</td>
<td class="org-left">A</td>
<td class="org-left">H</td>
<td class="org-left">O</td>
<td class="org-left">V</td>
<td class="org-left">C</td>
<td class="org-left">J</td>
<td class="org-left">Q</td>
<td class="org-left">X</td>
<td class="org-left">E</td>
<td class="org-left">L</td>
<td class="org-left">S</td>
<td class="org-left">Z</td>
<td class="org-left">G</td>
<td class="org-left">N</td>
<td class="org-left">U</td>
<td class="org-left">B</td>
<td class="org-left">I</td>
<td class="org-left">P</td>
<td class="org-left">W</td>
</tr>
</tbody>
</table>
</div>
<div id="outline-container-orgfcf7735" class="outline-4">
<h4 id="orgfcf7735"><span class="section-number-4">1.3.1.</span> Combinatoria</h4>
</div>

<div id="outline-container-org6b4cd8a" class="outline-4">
<h4 id="org6b4cd8a"><span class="section-number-4">1.3.2.</span> Ejercicio</h4>
<div class="outline-text-4" id="text-1-3-2">
<blockquote>
<p>
Pensar es olvidar diferencias, es generalizar, es abstraer. &#x2013; Jorge Luis Borgas
</p>
</blockquote>
</div>
</div>
</div>
<div id="outline-container-org3f4ed80" class="outline-3">
<h3 id="org3f4ed80"><span class="section-number-3">1.4.</span> Cifrado con palabras</h3>
</div>

<div id="outline-container-org5da7359" class="outline-3">
<h3 id="org5da7359"><span class="section-number-3">1.5.</span> Análisis</h3>
</div>
</div>
<div id="outline-container-org93a5430" class="outline-2">
<h2 id="org93a5430"><span class="section-number-2">2.</span> Sistemas polialfabéticos</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orgf826d56" class="outline-3">
<h3 id="orgf826d56"><span class="section-number-3">2.1.</span> Cifrado Vigenere</h3>
</div>
</div>
<div id="outline-container-org667f4cd" class="outline-2">
<h2 id="org667f4cd"><span class="section-number-2">3.</span> Sistemas poligráficos</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-orga33a283" class="outline-3">
<h3 id="orga33a283"><span class="section-number-3">3.1.</span> Cifrado Playfair</h3>
</div>
<div id="outline-container-orgd4a0e68" class="outline-3">
<h3 id="orgd4a0e68"><span class="section-number-3">3.2.</span> Cifrado Hill</h3>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Davidshiro Pichu</p>
<p class="date">Created: 2025-08-07 Thu 22:58</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
